erp3l/src/Catalogs/ДоверенностиНалогоплательщика/ДоверенностиНалогоплательщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоверенностиНалогоплательщика</name>
  <comment>Доверенности налогоплательщика на представителя</comment>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>НомерДовер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <comment>Дата выдачи доверенности</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <comment>Дата окончания действия доверенности</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакДоверителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительЮЛ_НаимОрг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительЮЛ_ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительЮЛ_КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительЮЛ_ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительРук_ИНН</name>
    <comment>ИНН руководителя организации-доверителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительФЛ_ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительФЛ_ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительФЛ_Гражданство</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительФЛ_ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительЮЛ_НаимОрг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительЮЛ_ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительЮЛ_КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительЮЛ_ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительФЛ_ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительФЛ_ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительФЛ_Гражданство</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительФЛ_ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НотариусЮЛ_НаимОрг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НотариусЮЛ_ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НотариусЮЛ_КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НотариусЮЛ_ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НотариусФЛ_ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительЯвляетсяЮЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительЯвляетсяЮЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НотариусЯвляетсяЮЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаверенаНотариально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоверительИмеетУЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительЯвляетсяСотрудником</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолномочияПредставителя</name>
    <comment>Полномочия представителя</comment>
    <attributes>
      <name>ПризнакПолныеПолномочия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак01</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак02</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак03</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак04</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак05</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак06</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак07</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак08</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак09</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак10</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак11</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак12</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак13</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак14</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак15</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак16</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак17</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак18</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак19</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак20</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак21</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак22</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОКАТО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <comment>Код причины постановки</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Признак23</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак24</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Признак25</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФИО</name>
    <attributes>
      <name>Владелец</name>
      <type>
        <types>EnumRef.СубъектыДоверенностиНалогоплательщика</types>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Адреса</name>
    <attributes>
      <name>Владелец</name>
      <type>
        <types>EnumRef.СубъектыДоверенностиНалогоплательщика</types>
      </type>
    </attributes>
    <attributes>
      <name>Индекс</name>
      <comment>Индекс</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодРегион</name>
      <comment>Код региона</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Район</name>
      <comment>Район</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <comment>Город</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаселПункт</name>
      <comment>Населенный пункт</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Улица</name>
      <comment>Улица</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дом</name>
      <comment>Дом</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Корпус</name>
      <comment>Корпус</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кварт</name>
      <comment>Квартира</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдЛичности</name>
    <attributes>
      <name>Владелец</name>
      <type>
        <types>EnumRef.СубъектыДоверенностиНалогоплательщика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДок</name>
      <type>
        <types>CatalogRef.ВидыДокументовФизическихЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>СерДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыдДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодВыдДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/ДоверенностиНалогоплательщика/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем ОшибкаЗаполнения Экспорт;

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ПометкаУдаления ИЛИ Ссылка.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = "Доверенность" + ?(ЗначениеЗаполнено(НомерДовер), " №" + НомерДовер, "") + " от " + Формат(ДатаВыдачи, "ДФ='dd.MM.yyyy ""г.""'");
	
	Заголовок = "Запись доверенности налогоплательщика (" + Владелец + ") " + Наименование + ", код " + Код;
	
	// Проверка заполнения обязательных реквизитов
	Если НЕ ЗначениеЗаполнено(Владелец) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не выбрана организация налогоплательщика';
													|en = 'Taxpayer company is not selected'"), ЭтотОбъект, "Владелец", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаВыдачи) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не указана дата выдачи доверенности';
													|en = 'Date of authorization letter issue is not specified'"), ЭтотОбъект, "ДатаВыдачи", , Отказ);
	КонецЕсли;
	
	Если ПолномочияПредставителя.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнены сведения о полномочиях представителя';
													|en = 'Information about the powers of the representative is not filled in'"), ЭтотОбъект, "ПолномочияПредставителя", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// проверяем юрлицо-представителя
	Если ПредставительЯвляетсяЮЛ Тогда
		
		// проверка ИНН юрлица-представителя
		Если ЗначениеЗаполнено(ПредставительЮЛ_ИНН) И НЕ РегламентированнаяОтчетностьВызовСервера.ИННСоответствуетТребованиямНаСервере(ПредставительЮЛ_ИНН, Ложь) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Некорректно задан ИНН организации-представителя';
														|en = 'TIN of the representative company is specified incorrectly'"), ЭтотОбъект, "ПредставительЮЛ_ИНН", , Отказ);
		КонецЕсли;
		
		// проверка КПП юрлица-представителя
		Если ЗначениеЗаполнено(ПредставительЮЛ_КПП) И НЕ РегламентированнаяОтчетностьКлиентСервер.КППСоответствуетТребованиям(ПредставительЮЛ_КПП) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Некорректно задан КПП организации-представителя';
														|en = 'CRTR of the representative company is specified incorrectly'"), ЭтотОбъект, "ПредставительЮЛ_КПП", , Отказ);
		КонецЕсли;
		
		// проверка ОГРН юрлица-представителя
		Если ЗначениеЗаполнено(ПредставительЮЛ_ОГРН) И СтрДлина(СокрЛП(ПредставительЮЛ_ОГРН)) <> 13 Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Некорректно задан ОГРН организации-представителя';
														|en = 'PSRN of the representative company is specified incorrectly'"), ЭтотОбъект, "ПредставительЮЛ_ОГРН", , Отказ);
		КонецЕсли;
		
	Иначе
		
		//представитель является физлицом
		Если НЕ ПредставительЯвляетсяСотрудником Тогда
			//должен быть заполнен ИНН физлица-представителя
			Если НЕ ЗначениеЗаполнено(ПредставительФЛ_ИНН) Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'У представителя, являющегося физлицом и не являющегося сотрудником организации должен быть задан ИНН';
															|en = 'A representative who is an individual and not a company employee must have the TIN specified'"), ЭтотОбъект, "ПредставительФЛ_ИНН", , Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// проверяем физлицо-представителя
	
	// проверка ИНН физлица-представителя
	Если ЗначениеЗаполнено(ПредставительФЛ_ИНН) И НЕ РегламентированнаяОтчетностьВызовСервера.ИННСоответствуетТребованиямНаСервере(ПредставительФЛ_ИНН, Истина) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Некорректно задан ИНН физлица-представителя';
													|en = 'TIN of the representative individual is specified incorrectly'"), ЭтотОбъект, "ПредставительФЛ_ИНН", , Отказ);
	КонецЕсли;
	
	// проверка ОГРН физлица-представителя
	Если ЗначениеЗаполнено(ПредставительФЛ_ОГРН) И СтрДлина(СокрЛП(ПредставительФЛ_ОГРН)) <> 15 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Некорректно задан ОГРН физлица-представителя';
													|en = 'PSRN of the representative individual is specified incorrectly'"), ЭтотОбъект, "ПредставительФЛ_ОГРН", , Отказ);
	КонецЕсли;
	
	Если ПризнакДоверителя = 2 ИЛИ ПризнакДоверителя = 3 Тогда
		
		// проверяем юрлицо-доверителя
		Если ПризнакДоверителя = 3 И ДоверительЯвляетсяЮЛ Тогда // доверитель - уполномоченный представитель
			
			// проверка ИНН юрлица-доверителя
			Если ЗначениеЗаполнено(ДоверительЮЛ_ИНН) И НЕ РегламентированнаяОтчетностьВызовСервера.ИННСоответствуетТребованиямНаСервере(ДоверительЮЛ_ИНН, Ложь) Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Некорректно задан ИНН доверителя-юрлица';
															|en = 'TIN of the authorizing legal entity is specified incorrectly'"), ЭтотОбъект, "ДоверительЮЛ_ИНН", , Отказ);
			КонецЕсли;
			
			// проверка КПП юрлица-доверителя
			Если ЗначениеЗаполнено(ДоверительЮЛ_КПП) И НЕ РегламентированнаяОтчетностьКлиентСервер.КППСоответствуетТребованиям(ДоверительЮЛ_КПП) Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Некорректно задан КПП доверителя-юрлица';
															|en = 'CRTR of the authorizing legal entity is specified incorrectly'"), ЭтотОбъект, "ДоверительЮЛ_КПП", , Отказ);
			КонецЕсли;
			
			// проверка ОГРН юрлица-доверителя
			Если ЗначениеЗаполнено(ДоверительЮЛ_ОГРН) И СтрДлина(СокрЛП(ДоверительЮЛ_ОГРН)) <> 13 Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Некорректно задан ОГРН доверителя-юрлица';
															|en = 'PSRN of the authorizing legal entity is specified incorrectly'"), ЭтотОбъект, "ДоверительЮЛ_ОГРН", , Отказ);
			КонецЕсли;
			
			// проверка ИНН руководителя юрлица-доверителя
			Если ЗначениеЗаполнено(ДоверительРук_ИНН) И НЕ РегламентированнаяОтчетностьВызовСервера.ИННСоответствуетТребованиямНаСервере(ДоверительРук_ИНН, Истина) Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Некорректно задан ИНН руководителя организации-доверителя';
															|en = 'TIN of the authorizing company''s CEO is specified incorrectly'"), ЭтотОбъект, "ДоверительРук_ИНН", , Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		// проверяем физлицо-доверителя
		Если ПризнакДоверителя = 2 ИЛИ (ПризнакДоверителя = 3 И ДоверительИмеетУЛ) Тогда
			
			// проверка ИНН физлица-доверителя
			Если ЗначениеЗаполнено(ДоверительФЛ_ИНН) И НЕ РегламентированнаяОтчетностьВызовСервера.ИННСоответствуетТребованиямНаСервере(ДоверительФЛ_ИНН, Истина) Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Некорректно задан ИНН физлица-доверителя';
															|en = 'TIN of the authorizing individual is specified incorrectly'"), ЭтотОбъект, "ДоверительФЛ_ИНН", , Отказ);
			КонецЕсли;
			
			// проверка ОГРН физлица-доверителя
			Если ЗначениеЗаполнено(ДоверительФЛ_ОГРН) И СтрДлина(СокрЛП(ДоверительФЛ_ОГРН)) <> 15 Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Некорректно задан ОГРНИП физлица-доверителя';
															|en = 'OGRNIP of the authorizing individual is specified incorrectly'"), ЭтотОбъект, "ДоверительФЛ_ОГРН", , Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// проверяем нотариуса
	Если ЗаверенаНотариально Тогда
		
		// проверяем юрлицо-нотариус
		Если НотариусЯвляетсяЮЛ Тогда
			
			// проверка ИНН юрлица-нотариуса
			Если ЗначениеЗаполнено(НотариусЮЛ_ИНН) И НЕ РегламентированнаяОтчетностьВызовСервера.ИННСоответствуетТребованиямНаСервере(НотариусЮЛ_ИНН, Ложь) Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Некорректно задан ИНН юрлица нотариуса';
															|en = 'TIN of the notary legal entity is specified incorrectly'"), ЭтотОбъект, "НотариусЮЛ_ИНН", , Отказ);
			КонецЕсли;
			
			// проверка КПП юрлица-нотариуса
			Если ЗначениеЗаполнено(НотариусЮЛ_КПП) И НЕ РегламентированнаяОтчетностьКлиентСервер.КППСоответствуетТребованиям(НотариусЮЛ_КПП) Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Некорректно задан КПП юрлица нотариуса';
															|en = 'CRTR of the notary legal entity is specified incorrectly'"), ЭтотОбъект, "НотариусЮЛ_КПП", , Отказ);
			КонецЕсли;
			
			// проверка ОГРН юрлица-нотариуса
			Если ЗначениеЗаполнено(НотариусЮЛ_ОГРН) И СтрДлина(СокрЛП(НотариусЮЛ_ОГРН)) <> 13 Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Некорректно задан ОГРН юрлица нотариуса';
															|en = 'PSRN of the notary legal entity is specified incorrectly'"), ЭтотОбъект, "НотариусЮЛ_ОГРН", , Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		// проверка ИНН юрлица-нотариуса
		Если ЗначениеЗаполнено(НотариусФЛ_ИНН) И НЕ РегламентированнаяОтчетностьВызовСервера.ИННСоответствуетТребованиямНаСервере(НотариусФЛ_ИНН, Истина) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Некорректно задан ИНН нотариуса-физлица';
														|en = 'TIN of the notary individual is specified incorrectly'"), ЭтотОбъект, "НотариусФЛ_ИНН", , Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если РегламентированнаяОтчетностьВызовСервера.ИспользуетсяОднаОрганизация() Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("Справочники.Организации");
        Владелец = Модуль.ОрганизацияПоУмолчанию();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
